## series

In [14]:
import pandas as pd
import numpy as np

In [4]:
#Create a pandas.Series from a Python list [12, 45, 30, 10, 90].
s = [12,45,30,10,90]
s1 = pd.Series(s)
print(s1)

0    12
1    45
2    30
3    10
4    90
dtype: int64

In [7]:
#Display:first 3 elements
print(s1[:3])

0    12
1    45
2    30
dtype: int64

In [13]:
#last 2 elements
print(s1[:2:-1])

4    90
3    10
dtype: int64

In [20]:
#series datatype
print(s1.dtype)

int64

In [37]:
#Create a Series with custom index:['Math', 'Science', 'English', 'History'] → [88, 92, 75, 80]
s = [88,92,75,80]
s1 = pd.Series(s,index = ["Math","Science","English","History"])
print(s1)
#Select Science and History using label indexing.
selected = s1.loc[["Math","History"]]
print()
print(selected)

Math       88
Science    92
English    75
History    80
dtype: int64

Math       88
History    80
dtype: int64

## DataFrame Practice

In [78]:
df = {"name":["Sam","Rita","john","Maya"],"Age":[21,22,20,19],"Score":[88,90,78,92]}
df2 = pd.DataFrame(df)
#Show shape
print(df2.shape)
#Show columns and index
print(df2)
print()
#Retrieve Score column
print((df2["Score"]))
print()
#Retrieve first two rows
print(df2.tail(2))

(4, 3)
   name  Age  Score
0   Sam   21     88
1  Rita   22     90
2  john   20     78
3  Maya   19     92

0    88
1    90
2    78
3    92
Name: Score, dtype: int64

   name  Age  Score
2  john   20     78
3  Maya   19     92

## Conditional Selection

In [65]:
#Select rows where Score > 90
print(df2[df2['Score']>90])

   name  Age  Score
3  Maya   19     92

In [72]:
#Select rows where Age < 21 AND Score > 80
print(df2[(df2['Age']<21)&(df2['Score']>80)])

   name  Age  Score
3  Maya   19     92

In [82]:
#Select only names of students with Score < 85
print(df2[df2['Score']<85][['name','Score']])

   name  Score
2  john     78

## Arithmetic Operations

In [88]:
df = {"product":["A","B","C"],"price":[30,60,56],"Quantity":[10,5,15]}
df1 = pd.DataFrame(df)
print(df1)

  product  price  Quantity
0       A     30        10
1       B     60         5
2       C     56        15

In [90]:
#Add a new column: Total = Price * Quantity
df1['total'] = df1['price']*df1['Quantity']
print((df1['total']))
print()
print(df1)

0    300
1    300
2    840
Name: total, dtype: int64

  product  price  Quantity  total
0       A     30        10    300
1       B     60         5    300
2       C     56        15    840

In [94]:
#Increase Price by 10% and store in a new column NewPrice
df1['newprice'] = df1['price']+((df1['price']*10)/100)
print(df1)

  product  price  Quantity  total  newprice
0       A     30        10    300      33.0
1       B     60         5    300      66.0
2       C     56        15    840      61.6

In [96]:
#Compare: NewPrice - Price
df1['compareprice'] = df1['newprice'] - df1['price']
print(df1)

  product  price  Quantity  total  newprice  compareprice
0       A     30        10    300      33.0           3.0
1       B     60         5    300      66.0           6.0
2       C     56        15    840      61.6           5.6

In [4]:
bonus = pd.Series([5, 10, 3], index=['Price', 'Quantity', 'Discount'])
print(bonus)
print()
frame = pd.DataFrame({"item":['pen','book'],
                      "Price":[10,50],
                      "Quantity":[5,2],
                      "Discount":[1,5]})

print(frame)

Price        5
Quantity    10
Discount     3
dtype: int64

   item  Price  Quantity  Discount
0   pen     10         5         1
1  book     50         2         5

In [5]:
#Add the bonus Series to the DataFrame → observe alignment
frame2 = bonus+frame
print(frame2)

   Discount  Price  Quantity item
0       4.0   15.0      15.0  NaN
1       8.0   55.0      12.0  NaN

In [6]:
#Multiply the DataFrame by 2 → what happens to string columns?
print(frame*2) ## strings gets repeated

       item  Price  Quantity  Discount
0    penpen     20        10         2
1  bookbook    100         4        10

In [7]:
#Subtract bonus from DataFrame 
frame3 = frame - bonus
print(frame3)

   Discount  Price  Quantity item
0      -2.0    5.0      -5.0  NaN
1       2.0   45.0      -8.0  NaN

In [5]:
#Create a DataFrame of 5 countries with columns:Country,Population (millions),Area (km²),Continent:
countrydata = {"country":["India","China","America","Italy","Turkey"],
            "Population(millions)":[1428,1412,339,59,85],
            "Area(km^2)":[3287263,9596961,9833520,301340,783562],
            "Continent":['Asia','Asia','NorthAmerica','Europe','Europe']}
dataframe = pd.DataFrame(countrydata)
print(dataframe)

   country  Population(millions)  Area(km^2)     Continent
0    India                  1428     3287263          Asia
1    China                  1412     9596961          Asia
2  America                   339     9833520  NorthAmerica
3    Italy                    59      301340        Europe
4   Turkey                    85      783562        Europe

In [11]:
#Compute Population Density
dataframe['Population_Density'] = dataframe['Population(millions)']*1000000000/dataframe['Area(km^2)']
print(dataframe['Population_Density'])

0    434403.940299
1    147129.909145
2     34473.921851
3    195792.128493
4    108478.971670
Name: Population_Density, dtype: float64

In [6]:
#Show only Asian countries
print(dataframe[dataframe['Continent']=='Asia'])

  country  Population(millions)  Area(km^2) Continent
0   India                  1428     3287263      Asia
1   China                  1412     9596961      Asia

In [12]:
#Sort by density descending
print(dataframe.sort_values(by='Population_Density',ascending = False))

   country  Population(millions)  Area(km^2)     Continent  Population_Density
0    India                  1428     3287263          Asia       434403.940299
3    Italy                    59      301340        Europe       195792.128493
1    China                  1412     9596961          Asia       147129.909145
4   Turkey                    85      783562        Europe       108478.971670
2  America                   339     9833520  NorthAmerica        34473.921851

In [34]:
df = pd.DataFrame(np.random.randint(1, 100, (5, 4)), columns=['A','B','C','D'])
df

    A   B   C   D
0  77   1   6  38
1   9  85  78  24
2  82  52  43  27
3  18   2  60  56
4  40  33  56  10

In [35]:
#Get mean of each column.
df.mean()

A    45.2
B    34.6
C    48.6
D    31.0
dtype: float64

In [33]:
#Add new column E = A + B
df['E'] = df['A']+df['B']
df

    A   B   C   D    E
0  92  28  47  22  120
1  49  76  10  61  125
2  70  18  63  28   88
3  60  78  69  45  138
4  53  38  62  86   91

In [24]:
#Replace all values < 50 with 0
df[df<50] = 0
print(df)

    A   B   C   D    E
0  68   0  93   0  111
1  93  91   0  60  184
2  57   0   0  72   99
3   0  72  79   0   89
4   0  78  63   0  119

In [36]:
#Multiply entire DataFrame by 3
df*3

     A    B    C    D
0  231    3   18  114
1   27  255  234   72
2  246  156  129   81
3   54    6  180  168
4  120   99  168   30

In [38]:
# Create a new column called final_price = price + (price * tax_rate)
df = pd.DataFrame({
    "price": [120, 80, 150, 200],
    "tax_rate": [0.1, 0.08, 0.15, 0.12]
})
print(df)
df['final_price'] = df['price']+df['price']*df['tax_rate']
df

   price  tax_rate
0    120      0.10
1     80      0.08
2    150      0.15
3    200      0.12

   price  tax_rate  final_price
0    120      0.10        132.0
1     80      0.08         86.4
2    150      0.15        172.5
3    200      0.12        224.0

In [45]:
#Return a Series showing True where the value in s1 is greater than the corresponding value in s2
s1 = pd.Series([10, 20, 30, 40])
s2 = pd.Series([8, 22, 29, 45])
result  = s1>s2
print(result)

0     True
1    False
2     True
3    False
dtype: bool

## Conditional Column Creation

In [54]:
#Create a new column "result" that contains "Pass" if score ≥ 60, else "Fail".
df = pd.DataFrame({
    "name": ["A", "B", "C", "D"],
    "score": [55, 92, 67, 40]
})
result = []
for i in df['score']:
    if i >= 60:
        result.append('pass')
    else:
        result.append('fail')
df['result'] = result
print(df)

  name  score result
0    A     55   fail
1    B     92   pass
2    C     67   pass
3    D     40   fail

## Basic DataFrame Arithmetic

In [56]:
#Add a new column "total" = math + science
df = pd.DataFrame({
    "math": [60, 70, 80],
    "science": [65, 75, 85]
})
df['total'] = df['math']+df['science']
df

   math  science  total
0    60       65    125
1    70       75    145
2    80       85    165

In [58]:
#Add a new column "average" = total / 2
df['average'] = df['total']/2
df

   math  science  total  average
0    60       65    125     62.5
1    70       75    145     72.5
2    80       85    165     82.5

In [60]:
#Create a Series containing the sum of each row.
df = pd.DataFrame({
    "a": [1, 4, 7],
    "b": [2, 5, 8],
    "c": [3, 6, 9]
})
df.sum(axis = 0)

a    12
b    15
c    18
dtype: int64

## Replace Values Using Arithmetic

In [92]:
#Replace all negative values with their positive version (absolute value) without using abs().

s = pd.Series([3, -2, 10, -5, 8])
s[s<0] = s[s<0]*-1
s

0     3
1     2
2    10
3     5
4     8
dtype: int64

## Combine Series Into a DataFrame

In [70]:
#Create a DataFrame with columns "name" and "mk".
names = pd.Series(["A", "B", "C"])
marks = pd.Series([80, 95, 88])
df= pd.DataFrame({"name":names,"mk":marks})
print(df)

  name  mk
0    A  80
1    B  95
2    C  88

In [80]:
#Create a column "normalized" where each value = x / max(x)
df = pd.DataFrame({
    "x": [10, 20, 30, 40]
})
max_val = np.max(df['x'])
df['normalized'] = df['x']/max_val
df

    x  normalized
0  10        0.25
1  20        0.50
2  30        0.75
3  40        1.00

## Quick Missing Value Check

In [91]:
#Create a new column "missing_count" containing number of NaNs in each row.
df = pd.DataFrame({
    "col1": [1, None, 3],
    "col2": [4, 5, None]
})

print(df)
df['missing_value'] = df.isna().sum(axis = 1)
df

   col1  col2
0   1.0   4.0
1   NaN   5.0
2   3.0   NaN

   col1  col2  missing_value
0   1.0   4.0              0
1   NaN   5.0              1
2   3.0   NaN              1